// AOITreeNode.h: interface for the CAOITreeNode class.
//
//////////////////////////////////////////////////////////////////////

#if !defined(AFX_AOI_TREE_NODE_H__540F6D96_6DA9_4DD9_A9D0_463F8DF0827B__INCLUDED_)
#define AFX_AOI_TREE_NODE_H__540F6D96_6DA9_4DD9_A9D0_463F8DF0827B__INCLUDED_
//-------------------------------------------------------------------------------------//
#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000
//-------------------------------------------------------------------------------------//
#include <vector>
//-------------------------------------------------------------------------------------//
class CAOIObj;
//-------------------------------------------------------------------------------------//
class CAOITreeNode
{	
private:	
	//---------------------------------------------------------------------------------//		
	HTREEITEM                  m_hItem;
	CAOIObj                   *m_ObjPtr;
	//---------------------------------------------------------------------------------//		
	std::vector<CAOITreeNode>  m_ChildNodeList;	//樹狀節點列表
	int                        m_LastChildAdded;
	//---------------------------------------------------------------------------------//
protected:
	//---------------------------------------------------------------------------------//	
	//---------------------------------------------------------------------------------//
public:
	//---------------------------------------------------------------------------------//
	CAOITreeNode();	
	CAOITreeNode(HTREEITEM item, CAOIObj *Ptr);	
	virtual ~CAOITreeNode();	
	//---------------------------------------------------------------------------------//
	HTREEITEM GetHItem() const;
	void SetHItem(HTREEITEM val);	
	//---------------------------------------------------------------------------------//
	CAOIObj* GetObjPtr() const;
	void SetObjPtr(CAOIObj *Ptr);	
	//---------------------------------------------------------------------------------//
	size_t GetChildNodeCount() const;
	CAOITreeNode* GetChildNodePtr(size_t idx, bool bChk);
	void   AddChildNode(const CAOITreeNode &Node);
	void   AddChildNode(HTREEITEM item, CAOIObj *Ptr);
	//---------------------------------------------------------------------------------//
	int    GetLastChildAdded() const;//取得最後子節點已建立完畢
	void   SetLastChildAdded(int idx);//設定最後子節點已建立完畢
	//---------------------------------------------------------------------------------//
	bool   GetChildNodeListDone() const;//取得子節點已建立完畢	
	//---------------------------------------------------------------------------------//
};
//-------------------------------------------------------------------------------------//
#endif // !defined(AFX_AOI_TREE_NODE_H__540F6D96_6DA9_4DD9_A9D0_463F8DF0827B__INCLUDED_)
