#ifndef USER_HOT_KEY_ITEM_H_
#define USER_HOT_KEY_ITEM_H_
//-------------------------------------------------------------------------------------//
#pragma once
//-------------------------------------------------------------------------------------//
#include "UserHotKeyDef.h"
//-------------------------------------------------------------------------------------//
class CUserHotKeyCtrl;
//-------------------------------------------------------------------------------------//
class CUserHotKeyItem
{
	friend CUserHotKeyCtrl;
private:	
	//---------------------------------------------------------------------------------//
	HWND                         m_hWnd;//視窗	
	DWORD                        m_FuncID;//熱鍵功能編號
	CString                      m_FuncText;//熱鍵功能文字
	DWORD                        m_ExecID;//特定執行編號
	//---------------------------------------------------------------------------------//	
	UINT                         m_ModifyKey;//輔助建//MOD_ALT, MOD_CONTROL, MOD_SHIFT, MOD_WIN, MOD_NOREPEAT
	UINT                         m_VirtualKey;//虛擬建	
	//---------------------------------------------------------------------------------//
protected:
	//---------------------------------------------------------------------------------//
	UINT                       GetCmdID(DWORD FuncID) const;
	//---------------------------------------------------------------------------------//
public:
	//---------------------------------------------------------------------------------//	
	CUserHotKeyItem(DWORD FuncID=0, LPCTSTR Text=NULL, UINT VK=0, UINT MK=0, UINT ExecID=0);
	~CUserHotKeyItem();
	//---------------------------------------------------------------------------------//
	bool                       SaveUserHotKey(LPCTSTR pfilename, LPCTSTR pSection);
	bool                       LoadUserHotKey(LPCTSTR pfilename, LPCTSTR pSection);
	//---------------------------------------------------------------------------------//
	HWND                       GetHWnd() const;
	void                       SetHWnd(HWND val);
	//---------------------------------------------------------------------------------//
	DWORD                      GetFuncID() const;
	void                       SetFuncID(DWORD val);
	//---------------------------------------------------------------------------------//
	LPCTSTR                    GetFuncText() const;
	void                       SetFuncText(LPCTSTR val);
	//---------------------------------------------------------------------------------//	
	DWORD                      GetExecID() const;
	void                       SetExecID(DWORD val);
	//---------------------------------------------------------------------------------//		
	UINT                       GetModifyKey() const;
	void                       SetModifyKey(UINT val);
	//---------------------------------------------------------------------------------//
	UINT                       GetVirtualKey() const;
	void                       SetVirtualKey(UINT val);
	//---------------------------------------------------------------------------------//	
	bool                       CheckEnabled() const;//確認有啟用熱鍵
	void                       DisableUserHotyKey();//取消熱鍵
	//---------------------------------------------------------------------------------//
	bool                       Unregister();
	bool                       Register(HWND hWnd);	
	//---------------------------------------------------------------------------------//	
	void                       GetHotKeyText(CString &Text);
	//---------------------------------------------------------------------------------//	
	bool                       Convert2Accel(ACCEL &rAccel) const;
	//---------------------------------------------------------------------------------//	
};
//-------------------------------------------------------------------------------------//
#endif//USER_HOT_KEY_ITEM_H_
